// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int numberA = 3;
int numberB = 2;
int max = numberA;
if (numberB>max) max=numberB;
Console.Write("max=");
Console.WriteLine(max);
