//Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
int numberA = 3;
int numberB = 2;
int max = numberA;
if (numberB>max) max=numberB;
Console.Write("max=");
Console.WriteLine(max);
