// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
double N = 10;
double A = 1;
while (A < N) 
if (A % 2 ==0) 
{
    Console.WriteLine (A);
}
else 
{
A = A + 1 ;
}