// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//изменила решение
for (int N = 1; N <= 100; N += 1)
Console.WriteLine(N);