// Задача 3: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка)
double a = -3;
if ( a%2 == 0)
{
Console.WriteLine ("Число четное");
}
 else
{
    Console.WriteLine ("Число нечетное");
}